# Primera Parte: Carga de Datos

In [66]:
import pandas as pd

In [67]:
# En esta parte se carga la Data y se visualiza la cantidad de campos que se tiene en la data.
Uni=pd.read_csv('qs-world-university-rankings-2017-to-2022-V2.csv')
Uni.head()
Uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6482 entries, 0 to 6481
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   university              6482 non-null   object
 1   year                    6482 non-null   int64
 2   rank_display            6414 non-null   object
 3   score                   2820 non-null   float64
 4   link                    6482 non-null   object
 5   country                 6482 non-null   object
 6   city                    6304 non-null   object
 7   region                  6482 non-null   object
 8   logo                    6482 non-null   object
 9   type                    6470 non-null   object
 10  research_output         6480 non-null   object
 11  student_faculty_ratio   6407 non-null   float64
 12  international_students  6318 non-null   object
 13  size                    6480 non-null   object
 14  faculty_count           6404 non-null   object
dtypes: float64(2), int64(1), object(12)
memory usage: 759.7+ KB

# Segunda Parte: Limpieza de Datos

In [68]:
#Seleccionando los campos con los que se va a trabajar.
Uni=Uni[['research_output','international_students','type','score',]]

In [69]:
#ver el numero de registros null.
Uni.isna().sum()

research_output              2
international_students     164
type                        12
score                     3662
dtype: int64

In [70]:
Uni

     research_output international_students     type  score
0          Very High                  3,730  Private  100.0
1          Very High                  3,879  Private   98.7
2          Very High                  5,877  Private   98.3
3          Very high                  7,925   Public   97.2
4          Very High                    692  Private   96.9
...              ...                    ...      ...    ...
6477            High                     57   Public    NaN
6478       Very High                    585   Public    NaN
6479          Medium                  2,826   Public    NaN
6480            High                  2,394   Public    NaN
6481            High                  2,300   Public    NaN

[6482 rows x 4 columns]

In [72]:
#Llenando los campos nulos con la media del campo score.
Uni['score'] = Uni['score'].fillna(Uni['score'].mean())
Uni.isna().sum()

research_output             2
international_students    164
type                       12
score                       0
dtype: int64

In [115]:
#llenando de el tipo de universidad con private o public. 
import random as rd
tipos=['private','public']
def filltype(tipo):
 i=rd.randint(0,1) # rango de 0 a 1
 tipo=tipos[i]
 return tipo
Uni['type'] = Uni['type'].fillna(Uni['type'].apply(filltype))

In [117]:
Uni

     research_output international_students     type       score
0          Very High                  3,730  Private  100.000000
1          Very High                  3,879  Private   98.700000
2          Very High                  5,877  Private   98.300000
3          Very high                  7,925   Public   97.200000
4          Very High                    692  Private   96.900000
...              ...                    ...      ...         ...
6477            High                     57   Public   46.595532
6478       Very High                    585   Public   46.595532
6479          Medium                  2,826   Public   46.595532
6480            High                  2,394   Public   46.595532
6481            High                  2,300   Public   46.595532

[6482 rows x 4 columns]

In [119]:
Uni.isna().sum()

research_output             2
international_students    164
type                        0
score                       0
dtype: int64

In [120]:
quality=['very high','medium','high','low']
def fillquality(tipo):
 i=rd.randint(0,3)
 tipo=quality[i]
 return tipo
Uni['research_output'] = Uni['research_output'].fillna(Uni['research_output'].apply(fillquality))

In [121]:
Uni.isna().sum()
#comvercion a  minuscula
Uni['research_output']=Uni['research_output'].str.lower()

In [122]:
Uni.tail(10)

     research_output international_students    type      score
6472          medium                  1,003  Public  46.595532
6473            high                    373  Public  46.595532
6474            high                  1,244  Public  46.595532
6475       very high                  2,441  Public  46.595532
6476            high                  1,976  Public  46.595532
6477            high                     57  Public  46.595532
6478       very high                    585  Public  46.595532
6479          medium                  2,826  Public  46.595532
6480            high                  2,394  Public  46.595532
6481            high                  2,300  Public  46.595532

In [123]:
import re
#Limpiando los puntos y comas del campo international_students
Uni['international_students']=Uni['international_students'].str.replace(re.compile('[\.,]'),'')

In [124]:
#llenado del campo international_students con valores de rango [1000-25000]
def fillstudents(tipo):
 i=rd.randint(1000,25000)
 return str(i)
Uni['international_students']= Uni['international_students'].fillna(Uni['international_students'].apply(fillstudents))

In [125]:
#visualizacon de los campos a utilizar
Uni.isna().sum()

research_output           0
international_students    0
type                      0
score                     0
dtype: int64

In [126]:
#comvercion del campo international_students  de string a int
Uni['international_students']=Uni['international_students'].astype(int)
Uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6482 entries, 0 to 6481
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   research_output         6482 non-null   object
 1   international_students  6482 non-null   int64
 2   type                    6482 non-null   object
 3   score                   6482 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 202.7+ KB

# Tercera Parte: Normalizacion de Datos